PANDAS-DATAFRAME AND SERIES 
Pandas is a powerful data manipulation library inPython, widely used for data analysis and data cleaning

In [1]:
import pandas as pd

In [2]:
##series

import pandas as pd
data=[1,2,3,4,5,6]
series=pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
## Create a Series from dictionary

data={'a':1,'b':2,'c':3,'d':4}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [3]:
## Dataframe
## create a dataframe

data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Banglore','New York','Texas']
}
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age      City
0  Krish   25  Banglore
1   John   30  New York
2   Jack   45     Texas
<class 'pandas.core.frame.DataFrame'>

In [4]:
import numpy as np
np.array(df)

array([['Krish', 25, 'Banglore'],
       ['John', 30, 'New York'],
       ['Jack', 45, 'Texas']], dtype=object)

In [6]:
## Create a dataframe from a list of dictionary

data=[
   {'Name':'Achyut','Age':32,'City':'Banglore'},
   {'Name':'Srikant','Age':35,'City':'Newyork'},
   {'Name':'Ajay','Age':34,'City':'Jaipur'},

]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age      City
0   Achyut   32  Banglore
1  Srikant   35   Newyork
2     Ajay   34    Jaipur
<class 'pandas.core.frame.DataFrame'>

In [8]:
df=pd.read_csv('student.csv')
print(df.head(10))

    ID               Name  Age Branch  Year  CGPA       City  \
0  101  Achyut Srivastava   18    CSE     1   8.4  Prayagraj
1  102       Rahul Sharma   19     EE     1   7.9      Delhi
2  103       Ananya Verma   18    ECE     1   8.7    Lucknow
3  104         Aman Gupta   20     ME     2   7.5     Kanpur
4  105        Priya Singh   19    CSE     1   9.1   Varanasi
5  106        Rohit Kumar   21     CE     3   6.8      Patna
6  107        Neha Mishra   20    ECE     2   8.2  Allahabad
7  108       Saurabh Jain   22     ME     4   7.1       Agra
8  109        Pooja Yadav   19     EE     1   8.6  Gorakhpur
9  110      Aditya Pandey   21    CSE     3   9.0    Jaunpur

                 Email
0   achyut@example.com
1    rahul@example.com
2   ananya@example.com
3     aman@example.com
4    priya@example.com
5    rohit@example.com
6     neha@example.com
7  saurabh@example.com
8    pooja@example.com
9   aditya@example.com

In [9]:
### accessing data from dataframe

df['Name']

0     Achyut Srivastava
1          Rahul Sharma
2          Ananya Verma
3            Aman Gupta
4           Priya Singh
5           Rohit Kumar
6           Neha Mishra
7          Saurabh Jain
8           Pooja Yadav
9         Aditya Pandey
10          Kunal Singh
11        Shreya Kapoor
12        Manish Tiwari
13        Aarti Chauhan
14         Nitin Saxena
15           Riya Arora
16          Vikas Patel
17          Simran Kaur
18         Deepak Yadav
19          Khushi Jain
20      Abhishek Mishra
21          Sneha Singh
22       Arjun Malhotra
23        Kavya Agarwal
24          Harsh Verma
25          Tanvi Joshi
26         Mohit Bansal
27        Isha Tripathi
28          Ayush Singh
29       Nandini Shukla
30         Rajeev Kumar
Name: Name, dtype: object

In [ ]:
df.[3,'Branch']

'ME'

In [ ]:
##accessing an element at specified loation using iat

ans=df.iat[2,2]
print(ans)

18

In [17]:
## data manipulation with dataframe

df.loc[:2, 'Age'] = [50, 23, 43]
df.head(3)

,ID,Name,Age,Branch,Year,CGPA,City,Email
0,101,Achyut Srivastava,50,CSE,1,8.4,Prayagraj,achyut@example.com
1,102,Rahul Sharma,23,EE,1,7.9,Delhi,rahul@example.com
2,103,Ananya Verma,43,ECE,1,8.7,Lucknow,ananya@example.com

In [20]:
##Remove a coloumn

df.drop('City',axis=1,inplace=True)

In [21]:
df

     ID               Name  Age Branch  Year  CGPA                 Email
0   101  Achyut Srivastava   50    CSE     1   8.4    achyut@example.com
1   102       Rahul Sharma   23     EE     1   7.9     rahul@example.com
2   103       Ananya Verma   43    ECE     1   8.7    ananya@example.com
3   104         Aman Gupta   20     ME     2   7.5      aman@example.com
4   105        Priya Singh   19    CSE     1   9.1     priya@example.com
5   106        Rohit Kumar   21     CE     3   6.8     rohit@example.com
6   107        Neha Mishra   20    ECE     2   8.2      neha@example.com
7   108       Saurabh Jain   22     ME     4   7.1   saurabh@example.com
8   109        Pooja Yadav   19     EE     1   8.6     pooja@example.com
9   110      Aditya Pandey   21    CSE     3   9.0    aditya@example.com
10  111        Kunal Singh   20     CE     2   7.4     kunal@example.com
11  112      Shreya Kapoor   18    CSE     1   8.9    shreya@example.com
12  113      Manish Tiwari   22    ECE     4   6.9    manish@example.com
13  114      Aarti Chauhan   19     ME     1   7.8     aarti@example.com
14  115       Nitin Saxena   21     EE     3   8.1     nitin@example.com
15  116         Riya Arora   20    CSE     2   9.2      riya@example.com
16  117        Vikas Patel   23     CE     4   6.5     vikas@example.com
17  118        Simran Kaur   18    ECE     1   8.3    simran@example.com
18  119       Deepak Yadav   22     ME     4   7.0    deepak@example.com
19  120        Khushi Jain   19    CSE     1   9.4    khushi@example.com
20  121    Abhishek Mishra   21     EE     3   7.6  abhishek@example.com
21  122        Sneha Singh   20    ECE     2   8.8     sneha@example.com
22  123     Arjun Malhotra   22    CSE     4   8.0     arjun@example.com
23  124      Kavya Agarwal   18     ME     1   8.5     kavya@example.com
24  125        Harsh Verma   21     CE     3   7.2     harsh@example.com
25  126        Tanvi Joshi   19     EE     1   9.0     tanvi@example.com
26  127       Mohit Bansal   23    ECE     4   6.7     mohit@example.com
27  128      Isha Tripathi   20    CSE     2   8.9      isha@example.com
28  129        Ayush Singh   22     ME     4   7.3     ayush@example.com
29  130     Nandini Shukla   19     EE     1   9.1   nandini@example.com
30  131       Rajeev Kumar   21     CE     3   6.9    rajeev@example.com

In [22]:
## if we want permanent change that city will remove from data use inplace=true

df.describe()

               ID        Age       Year       CGPA
count   31.000000  31.000000  31.000000  31.000000
mean   116.000000  22.129032   2.258065   8.025806
std      9.092121   6.731726   1.210172   0.875963
min    101.000000  18.000000   1.000000   6.500000
25%    108.500000  19.000000   1.000000   7.250000
50%    116.000000  21.000000   2.000000   8.100000
75%    123.500000  22.000000   3.000000   8.850000
max    131.000000  50.000000   4.000000   9.400000